package org.ritsu.mirai.plugin.commands

/**
 * 可供随机的菜品单例
 *
 * @author RyouonRitsu
 * @since 0.1.0
 */
object Dish {
    /**
     * 菜单列表
     */
    val dishMap: Map<String, List<String>> = mapOf(
        "家常菜" to listOf(
            "夫妻肺片", "糖醋排骨", "醋熘鸡", "客家小炒", "皮蛋豆腐", "鱼香豆腐", "酸辣口水鸡", "麻婆豆腐", "可乐鸡翅", "香菇豆腐饼",
            "鱼香肉丝", "彩椒鲜虾仁", "蒜烧排骨", "酸辣土豆丝", "椒盐排骨", "糖醋鱼", "东坡鱼", "东坡肘子", "凉拌茄子", "宫保鸡丁",
            "东坡肉", "大杂烩", "鸡蛋炒西红柿", "芋头扣肉", "酸菜鱼", "棒棒鸡", "水煮鱼", "水煮肉片", "回锅肉", "土豆炖豆角", "脆炒南瓜丝",
            "鸡豆花", "红烧肉", "泡菜鱼", "双菜炒素鸡", "青椒肉片", "酱焖鲫鱼", "板栗烧鸡", "炝三丝", "醋熘土豆丝", "瓤莲藕", "百合炒鱼片"
        ),
        "川菜" to listOf(
            "冬菜肉末", "毛肚火锅", "鸭掌包", "片皮挂炉鸭", "杏仁银肺汤", "辣子肉丁", "芝麻兔", "虫草鸭舌", "豆渣猪头", "麻婆豆腐",
            "果仁徘骨", "酸辣白菜", "香辣虾", "成都蛋汤", "番茄豆腐炒肉片", "羊肉汤锅", "芹黄鱼丝", "辣椒鱼", "蓉城鸳鸯卷", "正宗重庆辣子鸡",
            "鸡丝海蜇", "香酥山药", "麻辣豆腐", "鲜椒嫩仔鸡", "鱼香牛肉丝", "泡菜肉末", "魔芋烧鸭", "合川肉片", "丁香鸭", "荷包鱿鱼",
            "豆瓣肘子", "原笼玉簪", "香椿白肉丝", "红烧舌尾", "川香辣子鸡", "鱼香茄饼", "清蒸青鳝", "参蒸鳝段", "盐煎肉", "烤扁担肉",
            "芹黄烧鱼条", "红椒爆鲜虾", "椒麻鸡", "回锅肉", "果仁排骨", "花椒鸡丁", "炖牛掌", "火爆双脆", "鸡蹄花", "雪花鸡淖", "鹅黄肉",
            "筒子肉", "箩粉鱼头豆腐汤", "羊耳鸡塔", "连理双味鱼", "珍珠酥皮鸡", "酸辣臊子蹄筋", "乡村嫩鸡川菜名菜", "酸辣海参", "干煸冬笋",
            "茄汁鱼卷", "炒鸡什件", "复元汤", "吉利大虾", "锅巴肉片", "腐皮虾包", "南排杂烩", "黄焖鸡块", "鸡豆花", "豆瓣鲫鱼", "芪蒸鹌鹑",
            "干煸鳝鱼丝", "芪烧活鱼", "麻辣肉丁", "参杞羊头", "鸡丝米粉", "荷叶凤脯", "菠饺鱼肚", "鱼香肉片", "坛子肉", "连锅汤", "陈皮鸡",
            "东坡肘子", "金钱芝麻虾", "枸杞海参鸽蛋", "酥皮龙虾", "糖醋鸡圆", "糖醋红柿椒", "蚕豆炒虾仁", "干烧鱼翅", "软烧仔鲇", "参麦团鱼",
            "灯影苕片", "蒲江蟹羹", "砂锅鱿鱼", "开水白菜", "家常海参", "首乌肝片", "恋爱豆腐", "鱼香肉丝", "豆苗炒鸡片", "桃酥鸡糕", "凉粉鲫鱼",
            "金钱鸡塔", "玻璃鱿鱼", "樟茶鸭子", "爆炒腰花", "炖鸡汁", "炸蒸肉", "牛膝蹄筋", "干煸鳝背", "麻辣猪肝", "东坡肉", "荔枝鱿鱼卷",
            "麻油火鸡肾", "鱼香腰花", "南卤醉虾", "黄豆芽排骨豆腐汤", "乌发汤", "豆瓣海参", "一品豆腐汤", "南荠烧鸭丁", "软炸白花鸽", "玉兔葵菜尖",
            "家常鸡块", "软炸虾糕", "炒面线", "凉拌怪味鸡", "绣球鱼翅", "鲜花豆腐", "人参全鸡煲", "网油包烧鸡", "玉竹心子", "芝麻肉丝",
            "芹黄烧鱼条大众菜", "烟熏排骨", "辣炒鱿鱼丝", "酱爆肉", "麻油鸡", "金钩青菜心", "宫保鸡丁", "麻酱凤尾", "椒盐八宝鸡", "五花肉炒豆腐泡菜",
            "水晶南瓜", "百仁全鸭", "瓤甜椒", "浦江蟹羹", "虫草鹌鹑", "干煸肉丝", "泡菜炒肉末", "沸腾羊肉", "炝黄瓜", "七星鱼丸汤",
            "山楂肉干", "红烧狮子头", "栗子白菜", "川西肉豆腐", "酱酥桃仁", "火鞭牛肉", "生炒蒜苔肉", "红枣煨肘", "夹沙肉", "炸花仁腰块",
            "炸珍珠虾", "金钱口蘑汤", "银杏蒸鸭", "姜汁热味鸡", "烩鸭四宝", "红烧猪蹄", "醋溜黄瓜", "酱爆鸭块", "生爆盐煎肉", "鹰扬虎视",
            "川芎茶", "炒豌豆夹", "网油腰卷", "碎米鸡丁", "红烧蹄筋", "东坡墨鱼", "水煮肉片", "酸菜鱼", "红油抄手", "三杯鸡", "一品酥方",
            "荷叶蒸肉", "酸菜肚片汤", "葱辣鱼", "蛋酥花仁", "豆瓣鱼", "金钱海参", "清汤燕菜", "豆腐鲫鱼", "红烧卷筒鸡", "口袋豆腐",
            "荷叶粉蒸鸡", "海鲜拼盘", "香酥鸭", "砂仁肚条", "红烧牛腩", "糊涂鸡", "糖粘羊尾", "一品海参", "火爆荔枝腰", "荷花豆腐大虾",
            "龙眼甜烧白", "鱼香碎滑肉", "川味牛肉", "辣椒蟹", "粉蒸牛肉", "葱辣鱼条", "麻辣白菜", "红杞活鱼", "鸡包鱼翅", "干蒸黄鱼",
            "珍珠圆子", "豆苗炒虾片", "樟茶鸭", "水浒肉", "网油鱼包", "白汁鱼肚", "白果烧鸡", "三菌炖鸡", "荷包豆腐", "蚂蚁上树",
            "巴国玉米糕", "姜汁热窝鸡", "甜椒肉丝", "油淋笋鸡", "锅贴鸡片", "炸班指", "红油耳片", "太白鸭子", "辣白菜", "炸馓子",
            "贵妃鸡翅", "清水白菜", "粉蒸鸡", "锅贴鱼片", "豆鼓鱼", "盐水肫花", "沙参心肺汤", "椒盐蹄膀", "小煎鸡", "火爆肚头", "冬瓜燕",
            "苕菜狮子头", "手撕鸡", "鱼香荷包蛋", "水煮牛肉", "陈皮牛肉", "酿青椒", "粉蒸排骨", "火爆腰花", "四川家常酸辣汤", "生烧筋尾舌",
            "艄公号子鱼", "冬菜扣肉", "棒棒鸡丝", "西芹百合草莓炒腊肉", "五香脆皮鸡", "干煸四季豆", "双色玫瑰鱼", "三丝鱼翅", "芦笋牛肉",
            "虾须牛肉", "泡菜鱼", "龙眼咸烧白", "苦瓜酿肉", "牛腩煲", "夫妻肺片", "榨菜肉丝", "枸杞煨鸡汤", "重庆毛血旺特色菜", "叉烧鱼", "杞鞭壮阳汤"
        ),
        "鲁菜" to listOf(
            "双味蹄筋", "双烤肉", "四喜鸭子", "雪梨肘棒", "焖大虾", "龙眼凤肝", "奶汤蒲菜", "胡椒海参汤", "整鱼两吃", "荷叶肉",
            "泰山赤鳞鱼", "山东菜丸", "拔丝苹果", "番茄松鼠鱼", "龙潭钓玉牌", "素锅烤鸭", "蜜汁金枣", "炸灌汤丸子", "纸包鸡",
            "奶汤鲜核桃仁", "换心乌贼", "砂锅三味", "酒香椒盐肘子", "红烧鱼唇", "紫桂焖大排", "全虾三做", "蜜汁梨球", "锅烧鸭",
            "玛瑙银杏", "炸菠菜脯", "福山烧小鸡", "落叶琵琶虾", "软烧豆腐", "酥炸春花肉", "烤小鸡", "芝麻鱼球", "烤花揽桂鱼", "锅烧鸡",
            "锅塌鸡签", "龙凤双腿", "奶汤银肺", "冬菇烧蹄筋", "素火腿", "蒜苗火鸡排", "麻粉肘子", "油爆双脆", "南煎丸子", "烧罗汉面筋",
            "珊瑚金钩", "清汤柳叶燕菜", "扒酿海参", "炸豆腐丸子", "杨梅虾球", "熬黄花鱼", "泰安三美豆腐", "什锦蜂窝豆腐", "烤花揽鳜鱼",
            "炒豆腐脑", "凤尾金鱼", "馏鱼片"
        ),
        "粤菜" to listOf(
            "蒜香鲶鱼", "客家酿豆腐", "蜜椒蝴蝶片", "煎丸子", "豆腐咸鱼头汤", "麻仁当归猪踭汤", "酥盐鸡块", "西红柿肉片汤", "肉酿生麸圆",
            "凉瓜浸田鸡", "咖喱海鲜锅", "玉须泥鳅汤", "蜜汁叉烧", "银耳杏仁百合汤", "番茄海蜇", "烧瓤鲜沙虫", "米茸芋丝虾煲",
            "乌骨鸡归黄汤", "秘制鸳鸯鸡", "淡菜紫菜瘦肉汤", "红斑二吃", "八珍鲩鱼", "罗汉果焖瓜子鸡", "瓜薏米淡菜汤", "鲜粟子鸡肉汤",
            "果汁鹌鹑", "金龙乳猪", "兰度鸽脯", "白玉翡翠", "番茄蛋花汤", "炒桂花鱼翅", "润肺菜干汤", "椰盅海皇", "西汁乳鸽", "红烧猪手",
            "香蕉百合银耳汤", "秘制国药中华鳖", "凤梨烩排骨", "玉米羹", "嘉禾雁扣", "苹果炖鱼", "扁豆薏米炖鸡脚", "凉瓜肉排汤",
            "沙参玉竹老鸭汤", "雪花片汤", "板栗焖仔鸡", "萝卜泡菜", "踭汤", "干炒牛河", "红枣炖蚕蛹", "荷叶鸡", "参果炖瘦肉", "三色龙虾",
            "油豆腐镶肉", "蚝油生菜", "葛根清肺汤", "芙蓉煎滑蛋", "溜肝尖", "脆薯凤尾虾", "奶味芦笋汤", "贝丝扒菜胆", "梨花豆腐汤",
            "沙丁鱼烙", "燕窝炖雪梨", "昆布海澡瘦肉汤", "口福鸡", "粟米香菇排骨汤", "香煎茄片", "酸汤龙骨面", "润燥黄豆肉排汤", "桑杏炖猪肺",
            "菜干鸭肾蜜枣汤", "元宝牛蒡", "凉拌海蜇", "山楂核桃茶", "五柳脆皮鱼", "韭菜炒肉", "黑鸡拆烩老猫公", "柠檬鸡", "淳安辣椒酱",
            "生鱼葛菜汤", "马铃薯笋焖鸡", "梅干菜烧肉", "七彩瓤猪肚", "金陵片皮鸭", "潮州肉冻", "三菇浸鱼云", "西式芦笋汤", "金银菜东菇墨鱼煲猪踭",
            "猴头菇炖竹丝鸡", "鲜竹牛肉", "莲子山药粥", "苹果牛肉炖煮", "芥兰炒香肠", "菊花猪肝汤", "三蛇羹", "清烩海参", "枸杞猪肝瘦肉汤",
            "西柚三文鱼", "车前子油焖虾", "古法扣全端", "香酥凤腿", "鹿角菜蛤蚧水鱼汤", "豆泥红枣", "白汁鲳鱼", "花雕鸡", "古老肉",
            "皱纹圆蹄", "鱼胶圆肉炖水鸭", "清汤银耳", "园林香液鸡", "梅菜蒸鱼尾", "杂豆小麦粥", "京乳藕片", "生炊麒麟鱼", "蒜子焖酣鱼",
            "石榴鸡", "打边炉", "炸子鸡", "西柠蜜糖乳鸽", "子萝鸭片", "雪花鱼翅", "青蒜鲤鱼汤", "甘菊猪肚", "浅色海鲜豉油", "牛蒡沙拉",
            "可口的葡萄醋", "罗汉果八珍汤", "双菇炖南蛇", "虾胶龙凤卷", "槐花猪肠汤", "茄汁明虾", "爆人参鸡片", "芥菜咸蛋鱼头汤", "三皮丝",
            "密汁牛蒡", "花生红米饭", "灵芝鸡汤", "红扒羊肉", "雪梨猪踭汤", "乳酸菌果汁酱", "舒心驻颜老火汤",
            "芡实猪肚汤", "蚝皇凤爪", "姜丝肉蟹", "五彩牛肉丝", "蜜豆鱼片", "牛蒡香羹", "剑花蜜枣猪肺汤", "罗汉果西洋菜猪", "芦笋煎黄菜",
            "辣拌血蛤", "什锦烩饭", "海参炖瘦肉", "香荽鱼松酿银萝", "银杞明目汤", "广式卤鸭翅"
        ),
        "湘菜" to listOf(
            "水煮猪杂", "酸辣狗肉", "辣椒鱼", "金鱼戏莲", "芙蓉鲫鱼", "东安子鸡", "开屏柴把桂鱼", "酸辣肘子", "菊花青鱼", "酸辣鸡丁",
            "剁椒鱼头", "黔味大虾", "发丝百叶", "组庵鱼翅", "葵花虾饼", "老妈子带鱼", "洞庭金龟", "腊味合蒸", "马蹄白果蛋花汤", "风情羊柳",
            "干锅手撕包菜", "干锅腊味河蚌", "麻辣田鸡腿", "煎连壳蟹", "翠竹粉蒸鱼", "炸八块", "火腿炒茄瓜", "清汤柴把鸭", "玻璃鲜墨",
            "潇湘猪手", "麻仁香酥鸭", "好丝百叶", "冰糖湘莲", "紫龙脱袍", "东安鸡", "浪花天香鱼", "麻辣子鸡", "口味虾", "辣椒炒肚片"
        ),
        "闽菜" to listOf(
            "银耳川鸭", "干烧牛肉片", "彩色肉丝", "醉排骨", "炒芙蓉蟹", "鱼腩煲", "拉糟鱼块", "糟片鸭", "厦门薄饼", "玟瑰大虾", "香油石鳞",
            "爆炒羊肚", "白焯响螺", "太极芋头", "龙须燕丸", "香露全鸡", "八生火锅", "龙身凤尾虾", "金钱干贝", "蛋拌豆腐", "水晶蹄膀香肴肉",
            "荤罗汉", "佛跳墙", "椒盐肚尖", "马蹄鸡丁", "沙锅鳝鱼", "西瓜盅", "干贝水晶鸡", "炸鸡排", "蛏溜奇", "油条西舌", "肉米鱼唇",
            "闽生果", "芝麻豆腐", "银杏芋泥", "苦中作乐", "一品鲍鱼", "一品鲳", "沙司牛尾", "七星丸", "生炒海蚌", "什锦豆腐煲"
        ),
        "浙菜" to listOf(
            "红烧猴头蘑", "菜心炒猪肝", "南肉春笋", "虾米拌豆腐", "馄饨香蕉卷", "糟熘鱼片", "糖拌菜心", "酥炸牛肉卷", "海米烧菜花",
            "糖醋鸡块", "拌莴笋", "藕香芹味", "三虾豆腐", "拌鸡块", "香橙糕", "菠萝龙眼鱼", "瑞士排骨", "麻酱拌豆腐", "麻酱白菜丝",
            "铁扒仔鸡", "油焖春笋", "糟油青鱼划水"
        ),
        "苏菜" to listOf(
            "珊瑚桂鱼", "拆冻鲫鱼", "清炖蟹粉狮子头", "扬州干丝", "肴肉", "鱼羊鲜"
        ),
        "徽菜" to listOf(
            "玉兔海参", "铁狮子头", "鸭黄豆腐", "徽式双冬", "花菇田鸡", "板栗仔鸡", "茶叶熏鸡", "李鸿章杂烩"
        ),
        "贵州菜" to listOf(
            "干洋芋片蒸火腿", "狗肉锅巴粉", "腊狗腿炖萝卜", "黄豆粉蒸肉", "怪噜红烧肉", "蒜香腌椒鸡", "吊罐牛筋干锅", "原汤羊肉火锅",
            "青椒童子鸡", "椒蒸腊肉", "花溪清汤鹅", "烤全羊", "烤鸡", "酸汤牛肉", "鱼包韭菜", "金钩挂玉牌", "白菜烩小豆", "酸菜毛肚",
            "干笋腊肉", "肠旺面", "清水鲫鱼火锅", "古镇猪脚", "糟香鲜笋", "河虾豆花火锅", "辣鸡米皮", "葱花苞拌豆腐", "油渣炒莲白", "豆花",
            "冰粉", "红苕凉粉", "魔芋折耳根", "肉饼鸡", "水城野菜炖鸡", "酸汤羊排火锅", "菜汁米豆腐", "荷叶捆鸡", "炸包谷粑", "豌豆肚片",
            "浑浆豆花", "香菇枸酱鸡", "豆豉脆哨火锅", "盐菜肉", "炒卷粉", "鸡血盐菜洋芋汤", "酸汤鱼", "一锅香", "蘸水烤鲜菌", "豌豆凉粉",
            "糯米包子", "竹香血豆腐蒸腊肉豉", "水城烙锅", "魔芋筋炒肉丝", "红汤水饺鸭", "夜郎一品盅", "豆腐果", "红焖小洋芋", "酸菜炒鸡皮",
            "炝炒剪刀菜", "火爆三宝", "豆花面", "胡萝卜炖仔排", "风味水饺牛肉", "肉圆子菜豆花", "脆臊炒豆渣", "泥鳅辣椒", "野葱青岩豆腐",
            "青椒寡蛋", "双味麻花鱼", "酸菜炒汤圆", "冰梅雪莲", "豆豉毛肚火锅", "芸豆蹄花火锅", "腌肉炒莴笋皮", "雄鸡点黑豆花火锅", "红豆馅夹沙肉",
            "腊狗肉干锅", "糟辣卷粉", "鸡汁萝卜丝", "素瓜豆", "阳郎鸡", "红油凉面", "素酸汤菜", "山楂夹藕片", "清明粑", "洋芋四季豆焖饭怪噜饭",
            "煳辣豆腐锅巴", "特色蘸水鱼", "香茅草炖鱼", "干椒豆豉回锅肉", "荷叶糯米鸡", "陈年道菜扣肉", "扎佐蹄膀", "雪菜拌毛豆", "沓臊馄饨",
            "盐酸菜蒸牛肉丸", "茼蒿菜炒豆腐", "笋尖炒胡豆", "油底肉炒阳藿", "乡村老腊肉火锅", "农家小炒肉", "创新筒笋鸡", "乡村外婆鸡",
            "糟辣茄盒", "老火腿炒莲藕", "烙荞饼", "宫保鸡", "菠萝小米饭", "农夫蹄膀", "薄荷洋芋片", "野薄荷拌耳舌", "圣果尖椒天麻鸡",
            "干蕨菜炒牛干巴", "冬瓜炖绿豆", "鸡丝荞粉", "鸭肉糯米饭", "煎炒烤菜", "杂粮粉蒸鸡", "酸菜荞疙瘩", "盗汗滋补鸡", "菜豆花", "豆沙粑",
            "坨坨肉", "包谷饭", "晾杆肥牛火锅", "酸菜饵块粑", "家庭火锅", "汆子汤", "酸笋炖腊肉", "焦麻田螺", "农家焴鸡蛋", "包谷粉蒸肉",
            "豆芽粉蒸肉", "鸡煮菜稀饭", "凉拌蕨根粉", "南瓜饼", "牛瘪", "老腊肉豆米火锅老猪脚火锅", "腌菜蒸甜肉", "丝娃娃", "酸豇豆炖老鸭",
            "土家蒜炝鱼", "水豆豉拌鲜蕨菜", "农家油焖鸡", "森林芝秀", "黄焖羊肉火锅", "花溪牛肉粉", "白果宫保鸡", "香辣豆包", "蒸煮炖菜",
            "金香回锅肉", "小米蚱", "瓤南瓜", "三香三杂", "洋芋粑", "豆豉炒油渣", "羊瘪狗肉火锅", "凉拌鲜鸡血", "黔珍黑木耳", "玫瑰瓜香玉",
            "手撕鱼", "羊肉粉", "回锅洋芋", "泡椒蹄皮", "子姜鸭", "烧椒夺鱼", "香辣河蟹干锅", "尖椒板筋", "奶汤脑花火锅", "泡鲜花生",
            "地米菜水饺", "金龙抱玉柱", "干锅生爆羊肉", "酸菜小豆汤", "凉卤拌菜", "庵汤", "香麦小河虾", "油炸臭豆腐", "血橙拌梨花", "糟辣鱼头",
            "菠菜猪肝汤", "酸笋牛肉", "水豆豉牛背筋", "椿芽烘蛋", "赛熊掌", "竹笼糯香骨", "陈年老腊肉脚板皮小豆煸风肉", "干锅火锅", "酸菜肚条火锅",
            "水豆豉风味南瓜泥", "油底肉炖青菜头", "贵州辣子鸡", "凉拌折耳根", "折耳根炒腊肉", "泡椒板筋"
        ),
        "海底捞火锅" to listOf(
            "热辣牛油锅", "浓汤番茄锅", "酸菜白肉锅", "真香锅", "醇香清油锅", "养生菌汤锅", "酸辣沙棘锅", "清水锅", "胡椒猪肚鸡汤锅",
            "金汤花胶鸡锅", "泰式冬阴功锅", "青椒锅", "三鲜锅", "川香美蛙锅", "豆花海鲜锅", "牛肉高汤锅", "玉米鲜蔬锅", "鲜汤酸菜鱼锅",
            "港式金汤锅", "女神胶原锅", "开胃酸汤锅", "椰子鸡锅", "三文鱼海鲜锅", "浓香咖喱锅", "骨头锅", "酸汤鱼锅"
        ),
        "主食" to listOf(
            "南昌拌粉", "花溪牛肉粉", "螺蛳粉", "火鸡面", "奶油火鸡面", "三个先生炸鸡", "麻辣小龙虾", "烧烤", "海鲜", "日料寿喜锅", "烧肉放题",
            "牛排", "烤鸭"
        ),
        "小吃" to listOf(
            "长沙臭豆腐", "芥末鸭掌", "酥炸鲜奶", "轰炸大鱿鱼", "锅巴土豆", "钵钵鸡", "花甲粉丝", "串串香", "凉皮", "烤冷面", "脆皮烤五花肉",
            "桥头排骨", "无骨鸡爪", "烤苕皮", "烤脑花", "烤鱿鱼", "小酥肉", "炸鸡柳", "盐酥鸡", "包浆豆腐"
        ),
        "甜品饮品" to listOf(
            "CoCo", "奈雪の茶", "一点点", "喜茶", "乐乐茶", "茶百道", "蜜雪冰城", "茶颜悦色", "书亦烧仙草", "一芳", "沪上阿姨", "DQ",
            "7分甜", "茶太良品", "本宫的茶", "好利来", "星巴克", "瑞幸", "COSTA"
        ),
        "快餐" to listOf(
            "KFC", "麦当劳", "汉堡王", "萨莉亚", "必胜客", "德克士", "达美乐", "比格披萨"
        )
    )
}

/**
 * 从菜品中随机出一个菜，可指定菜系
 *
 * @author RyouonRitsu
 * @param type 菜系
 * @return bot回复
 */
fun randomEat(type: String): String {
    //随机食物，可选根据类型随机
    if (type != "") {
        return if (Dish.dishMap.containsKey(type)) Dish.dishMap[type]!!.random()
        else "不知道这种类型哦! 可以使用\"kgg吃的类型\"来查询可供选择的类型名称!"
    }
    return Dish.dishMap[Dish.dishMap.keys.random()]!!.random()
}

/**
 * 从菜品中随机出一个菜，可指定菜系，可指定重复抽取次数
 *
 * @author RyouonRitsu
 * @param type 菜系
 * @param n 抽取次数
 * @return bot回复
 */
fun randomEat(type: String, n: Int): String {
    var string = ""
    for (i in 1..n) {
        val t = randomEat(type)
        if (t == "不知道这种类型哦! 可以使用\"kgg吃的类型\"来查询可供选择的类型名称!") {
            string += t
            break
        }
        string += "${i}. $t${if (t in string) " [重复]\n" else "\n"}"
    }
    return string
}

/**
 * 展示可供选择的菜系
 *
 * @author RyouonRitsu
 * @return 可供选择的菜系类型
 */
fun dishLs(): String {
    //显示所有类别
    var s = ""
    for (it in Dish.dishMap.keys) s += "$it "
    return "可选择的类型有: ${s.trim().replace(" ", ", ")}"
}